{
  "videoId": "BY-KcTjK6M4",
  "title": "Don’t Fly Blind! Master TBM 930 weather radar & VNAV",
  "description": "In this 5th episode of our TBM 930 getting started series, we go inside the \"high-altitude office\" to explore the advanced Garmin G3000 systems that make this aircraft a world-class turboprop. If you want to fly the TBM 930 like a professional pilot, you need to understand more than just the throttle; you need to master the art of cockpit management and all-weather navigation.\n\nWhat You Will Learn in this TBM 930 Tutorial: This video provides a deep dive into three critical pillars of TBM 930 flight operations:\n\n- Garmin GWX 70 Weather Radar Mastery: We break down how to use the TBM 930 weather radar, including Tilt management, Gain calibration, and using Vertical Scan to \"slice\" through storms. Learn why the GWX 70 is your most vital tool when flying through IMC (Instrument Meteorological Conditions).\n\n- Advanced IFR Navigation: ATC diversions happen fast at 330 knots. We demonstrate the \"Direct-To\" bezel shortcut and how to amend your flight plan mid-air without creating discontinuities in the Garmin G3000 logic.\n\n- VNAV & Top of Descent (TOD) Logic: Setting up your descent shouldn't be guesswork. We explain how to arm VNAV, identify your TOD marker on the MFD, and ensure the TBM 930 follows a perfect 3-degree vertical path to your destination.\n\n- The TBM 930 vs. Chuck Yeager: We also dive into the fascinating history of this aircraft, specifically how the TBM 930 broke a long-standing New York to Paris speed record previously held by the legendary Chuck Yeager in a Piper Cheyenne.\n\nWhy the TBM 930? Whether you are a Microsoft Flight Simulator (MSFS) enthusiast or a student of real-world aviation, the TBM 930 represents the pinnacle of single-engine performance. By the end of this TBM 930 tutorial series, you will move from being a passenger to a true flight manager.\n\n📖 Chapters\nIn this video, we cover:\n\n0:00 - Intro: The High-Altitude Office \n0:45 - Seeing through clouds: GWX 70 radar \n6:18 - Mid-Air Amendments & ATC Diversions\n7:43 - The Descent: VNAV & Top of Descent (TOD) \n21:48 - Nice to Know: The Chuck Yeager Record \n22:46 - Pro-Tip: The \"Nearest Airport\" Rule\n\n📷 Quick camera views\n- shift 1: primary flight display (PFD)\n- shift 2: multi function display (MFD)\n- shift 3: autopilot controls\n- shift 4: overview of PFD, MFD, autopilot controls, A/C, de ice system, landing gear,  pressurization and hot air flow\n- shift 5: throttle, trim, flap controls and fuel selector\n- shift 6: external/internal lights, electric power, engine start, fuel, ap/trims, ELT and oxygen controls\n- shift 7: similar like the previous option but including the panel emer\n- shift 8: power plugs\n- shift 9: left door\n- shift 0: passenger door\n\n💬 Question of the day: Have you ever experienced a \"Hot Start\" in a turboprop? Let me know your close calls below!\n\n🔔 Subscribe\nIf you like this video please consider to subscribe to my channel: https://bit.ly/34eNWDP\n\n⬇️ Downloads\nTBM 930 POH: https://letsflyvfr.com/wp-content/uploads/2024/11/TBM-930-Flight-Manual-POH.pdf\nGarmin G3000 - TBM 930: https://static.garmin.com/pumac/190-02047-01_A.pdf\nTBM-930 performance reference: https://gemini.google.com/share/2bbd96d647a5\n\n📼Other TBM-930 videos in this series:\nEntering the Glass Cockpit: TBM 930 & Garmin G3000 Guide:  https://youtu.be/47r3uv3fwV0\nBetter Than a Jet? ✈️ TBM 930: The Ultimate Speed Machine: https://youtu.be/sTrHfcCJRMo\nFire it up: TBM 930 engine start & beta range taxiing: https://youtu.be/lxHzNhVdLAo\nSTOP Crashing the TBM 930! ✈️ mastery of the torque roll 📝: https://youtu.be/NcmmACoitfM\n\n🔗 Other related links\nTutorials playlist: https://bit.ly/3l6fRdL\n\nWebsite: https://highintheflightsimsky.nl\nJoin our Discord: https://discord.gg/J3tZyhceUM\n\n#MSFS2024 #TBM930 #FlightSimulator #GarminG3000 #AviationTutorial #VNAV #IFRNavigation",
  "thumbnail": "https://i.ytimg.com/vi/BY-KcTjK6M4/sddefault.jpg",
  "thumbnailMedium": "https://i.ytimg.com/vi/BY-KcTjK6M4/mqdefault.jpg",
  "publishedAt": "2026-01-22T16:00:16.000Z",
  "duration": 1503,
  "tags": [
    "TBM 930 tutorial",
    "MSFS TBM 930 guide",
    "TBM 930 takeoff",
    "how to fly TBM 930",
    "MSFS turboprop tutorial",
    "TBM 930 G3000 guide",
    "Microsoft Flight Simulator 2024 TBM",
    "TBM 930 autopilot",
    "torque roll explained"
  ],
  "featured": false
}