{
  "videoId": "bzzIM98qWgM",
  "title": "Flight Simulator 2020 - POI's - France - Millau Viaduct",
  "description": "In this video we will fly over the Millau Viaduct. The Millau Viaduct (French: Viaduc de Millau, IPA: [vja.dyk də mi.jo]) is a multispan cable-stayed bridge completed in 2004 across the gorge valley of the Tarn near (west of) Millau in the Aveyron department in the Occitanie Region, in Southern France. The design team was led by engineer Michel Virlogeux and English architect Norman Foster. As of September 2020, it is the tallest bridge in the world, having a structural height of 336.4 metres (1,104 ft).\n\nThe Millau Viaduct is part of the A75–A71 autoroute axis from Paris to Béziers and Montpellier. The cost of construction was approximately € 394 million ($424 million). It was built over three years, formally inaugurated on 14 December 2004, and opened to traffic two days later on 16 December. The bridge has been consistently ranked as one of the greatest engineering achievements of modern times, and received the 2006 Outstanding Structure Award from the International Association for Bridge and Structural Engineering.\nThe cable-stayed metallic structure measures 720 m and, including the access viaducts, represents a total length of 3 356 m.\n\n🔔 If you like this video please consider to subscribe to my channel: https://bit.ly/34eNWDP 🔔 \n\nPOI playlist: https://bit.ly/3OX9zwv\nWebsite: https://highintheflightsimsky.nl\n\n#FlightSimulator2020 #FlightSim #FS2020 #shorts",
  "thumbnail": "https://i.ytimg.com/vi/bzzIM98qWgM/sddefault.jpg",
  "thumbnailMedium": "https://i.ytimg.com/vi/bzzIM98qWgM/mqdefault.jpg",
  "publishedAt": "2022-08-09T17:00:19.000Z",
  "duration": 59,
  "tags": [
    "Flight Simulator 2020",
    "flight plan",
    "microsoft flight simulator",
    "flight simulator",
    "microsoft flight simulator 2020",
    "msfs 2020",
    "flight sim 2020",
    "low altitude flight",
    "POI",
    "handcrafted",
    "handcrafted poi",
    "Millau Viaduct"
  ],
  "featured": false
}