{
  "videoId": "hDa0N1eU6p8",
  "title": "Flight Simulator 2020 - How to - Fenix Simulations A320 - prepping the aircraft for a flight",
  "description": "In this video we will have a look at how to prepare the Fenix Simulations A320 from scratch: start the airplane with all systems off. We will start with starting up several systems and then use the FMC and the Flypad to make sure we are ready to go. Steps which we will discuss are: adding a flight plan, loading the aircraft, setting up the performance setting and much more.\n\n0:00 title screen\n0:10 introduction\n1:28 start the aircraft systems: external power, battery, IRS calibration etc.\n5:20 FMC: reviewing the cargo, passengers and fuel options\n6:55 Flypad: fuel, passengers and cargo settings\n10:40 Flypad: importing the flight plan: Simbrief and Navigraph integration\n15:30 Flypad: calculate the V1, Vr and V2 settings\n17:20 FMC: configuring the init settings and performance settings\n25:37 FMC: validating the flight plan and adding the SID\n31:55 Switching on the lights\n32:14 Starting the engines\n34:41 Removing all group services equipment\n35:20 Call pushback truck\n\n🔔 If you like this video please consider to subscribe to my channel: https://bit.ly/34eNWDP 🔔 \n\nTutorials playlist: https://bit.ly/32nmUHH\nWebsite: https://highintheflightsimsky.nl\n\n#FlightSimulator2020 #FlightSim #FS2020",
  "thumbnail": "https://i.ytimg.com/vi/hDa0N1eU6p8/sddefault.jpg",
  "thumbnailMedium": "https://i.ytimg.com/vi/hDa0N1eU6p8/mqdefault.jpg",
  "publishedAt": "2022-05-22T20:44:49.000Z",
  "duration": 2327,
  "tags": [
    "Flight Simulator 2020",
    "microsoft flight simulator",
    "flight simulator",
    "microsoft flight simulator 2020",
    "msfs 2020",
    "Navigraph integration",
    "Navigraph integration in Fenix Simulations A320",
    "How to use the Navigraph integration in the Fenix Simulation A320",
    "Fenix Simulation A320 start the aircraft from scratch",
    "Fenix Simulation A320 start the aircraft from dark",
    "FMC",
    "Flypad",
    "A320 configuring weight and fuel"
  ],
  "featured": false
}