{
  "videoId": "HGcS8D2amTE",
  "title": "Flight Simulator 2020 - POI's - Malta - Fort tour",
  "description": "In this video we will fly over the three forts which have been added as POI's in MSFS as part of the World Update for Italy and Malta.\n\nFort St. Angelo (Maltese: Forti Sant'Anġlu or Fortizza Sant'Anġlu) is a bastioned fort in Birgu, Malta, located at the centre of the Grand Harbour. It was originally built in the medieval period as a castle called the Castrum Maris (English: Castle by the Sea; Italian: Castello al Mare). It was rebuilt by the Order of Saint John as a bastioned fort called Fort Saint Angelo between the 1530s and the 1560s, and it is best known for its role as the Order's headquarters during the Great Siege of Malta of 1565. A major reconstruction to designs of Carlos de Grunenbergh took place in the 1690s, giving the fort its current appearance.\n\nFort Manoel (Maltese: Forti Manoel or Fortizza Manoel) is a star fort on Manoel Island in Gżira, Malta. It was built in the 18th century by the Order of Saint John, during the reign of Grand Master António Manoel de Vilhena, after whom it is named. Fort Manoel is located to the north west of Valletta, and commands Marsamxett Harbour and the anchorage of Sliema Creek. The fort is an example of Baroque architecture, and it was designed with both functionality and aesthetics in mind.\n\nFort Tigné (Maltese: Il-Forti Tigné - Il-Fortizza ta' Tigné) is a polygonal fort in Tigné Point, Sliema, Malta. It was built by the Order of Saint John between 1793 and 1795 to protect the entrance to Marsamxett Harbour, and it is one of the oldest polygonal forts in the world. The fort was extensively altered by the British in the 19th century, and it remained in use by the military until 1979.\n\n🔔 If you like this video please consider to subscribe to my channel: https://bit.ly/34eNWDP 🔔 \n\nPOI playlist: https://bit.ly/3OX9zwv\nWebsite: https://highintheflightsimsky.nl\n\n#FlightSimulator2020 #FlightSim #FS2020 #shorts",
  "thumbnail": "https://i.ytimg.com/vi/HGcS8D2amTE/sddefault.jpg",
  "thumbnailMedium": "https://i.ytimg.com/vi/HGcS8D2amTE/mqdefault.jpg",
  "publishedAt": "2022-08-25T17:40:19.000Z",
  "duration": 60,
  "tags": [
    "Flight Simulator 2020",
    "flight plan",
    "microsoft flight simulator",
    "flight simulator",
    "microsoft flight simulator 2020",
    "msfs 2020",
    "flight sim 2020",
    "low altitude flight",
    "POI",
    "handcrafted",
    "handcrafted poi",
    "Fort Manoel",
    "Fort Tigné",
    "Fort St. Angelo"
  ],
  "featured": false
}