{
  "videoId": "K5MQb_JQ7UE",
  "title": "Flight Simulator 2020 - MSFS Update - Top Gun Maverick expansion",
  "description": "In this video we will have a look at the Top Gun Maverick expansion which has been released. The expansion contains the following additions:\n\n- A “Top Gun: Maverick Edition” livery for the F/A-18E Super Hornet.\n- Three training missions for the Super Hornet that will allow you to master \n  radical flight maneuvers including unrestricted take-offs, split S maneuvers, \n  and low altitude, high-speed maneuvering through complex terrain.\n- Five high-speed, low-level challenges that require utmost skill to navigate \n  just above mountains and traverse through canyons.\n- A carrier deck landing challenge, one of the most demanding operations in \n   the world of military aviation.\n- A never-before-unveiled hypersonic aircraft that can attain speeds of Mach \n  10 and altitudes greater than 150,000 feet above sea level.\n- A mission to roar into the stratosphere.\n\nAfter installing the required update we will look at the aircrafts and will try the carrier deck landing challenge first. After a few tries we will move on to the experimental aircraft which is also part of this update.\n\n0:00 intro\n0:10 reviewing release notes and install update\n1:48 install the Maverick expansion content\n4:42 reviewing the Maverick expansion content\n6:47 giving the carrier deck landing a try\n13:57 review of hypersonic aircraft\n\n🔔 If you like this video please consider to subscribe to my channel: https://bit.ly/34eNWDP 🔔 \n\nTutorials playlist: https://bit.ly/3l6fRdL\nWebsite: https://highintheflightsimsky.nl\n\n#FlightSimulator2020 #FlightSim #FS2020",
  "thumbnail": "https://i.ytimg.com/vi/K5MQb_JQ7UE/sddefault.jpg",
  "thumbnailMedium": "https://i.ytimg.com/vi/K5MQb_JQ7UE/mqdefault.jpg",
  "publishedAt": "2022-05-25T20:07:41.000Z",
  "duration": 1760,
  "tags": [
    "Flight Simulator 2020",
    "flight plan",
    "microsoft flight simulator",
    "flight simulator",
    "microsoft flight simulator 2020",
    "msfs 2020",
    "flight sim 2020",
    "Top Gun Maverick",
    "Top Gun Maverick expansion",
    "Landing on an aircraft carrier in MSFS",
    "Top Gun Maverick expansion released",
    "Playing Tom Cruise in MSFS 2020"
  ],
  "featured": false
}