{
  "videoId": "O3-Rg28f8bA",
  "title": "Flight Simulator 2020 - POI's - Norway - Urnes Stave Church",
  "description": "In this video we will fly over the Urnes Stave Church. Urnes Stave Church (Norwegian: Urnes stavkyrkje) is a 12th-century stave church at Ornes, along the Lustrafjorden in the municipality of Luster in Vestland county, Norway.\n\nThe church sits on the eastern side of the fjord, directly across the fjord from the village of Solvorn and about five kilometres (3 mi) east of the village of Hafslo. It is among the oldest stave churches in Norway, with parts of the lumber construction dating from the latter half of the 11th century.[1] The church was built in a long church basilica plan inspired by medieval Christian churches, with cylindrical columns and semi-circular arches inside. The decoration on capitals of the columns and outside of the church embodies the visual evidence of the Viking culture’s transformation, assimilation, and adoption of Christianity. The north portal of the church is defined as the Urnes style, which contains decorations derived from Norwegian mythology dating back to the 12th century.\n\nIt has been owned by Fortidsminneforeningen (Society for the Preservation of Norwegian Ancient Monuments) since 1881. In 1979, the Urnes Stave Church was listed as a World Heritage Site by UNESCO.\n\n🔔 If you like this video please consider to subscribe to my channel: https://bit.ly/34eNWDP 🔔 \n\nPOI playlist: https://bit.ly/3OX9zwv\nWebsite: https://highintheflightsimsky.nl\n\n#FlightSimulator2020 #FlightSim #FS2020 #shorts",
  "thumbnail": "https://i.ytimg.com/vi/O3-Rg28f8bA/sddefault.jpg",
  "thumbnailMedium": "https://i.ytimg.com/vi/O3-Rg28f8bA/mqdefault.jpg",
  "publishedAt": "2022-08-11T17:45:01.000Z",
  "duration": 56,
  "tags": [
    "Flight Simulator 2020",
    "flight plan",
    "microsoft flight simulator",
    "flight simulator",
    "microsoft flight simulator 2020",
    "msfs 2020",
    "flight sim 2020",
    "low altitude flight",
    "POI",
    "handcrafted",
    "handcrafted poi",
    "Urnes Stave Church"
  ],
  "featured": false
}