{
  "videoId": "T_EVKUyEgOA",
  "title": "🛫 MSFS 2020 Bari Karol Wojtyła Airport Addon Review - A Must-Have! 🌟",
  "description": "Discover the stunning new Bari Karol Wojtyła Airport addon for Microsoft Flight Simulator 2020! In this review, we dive into the incredible features of this addon, including high-resolution textures, custom 3D models, dynamic lighting, and more. Whether you’re a seasoned pilot or a flight sim enthusiast, this addon is sure to enhance your virtual flying experience. Watch now to see why this is a must-have for your MSFS 2020 collection!\n\nBari Karol Wojtyła Airport (Italian: Aeroporto di Bari-Karol Wojtyła) is an airport serving the city of Bari in Italy. It is approximately 8 km (5 mi) northwest from the town centre. Named after Pope John Paul II, who was born Karol Wojtyła, the airport is also known as Palese Airport (Italian: Aeroporto di Palese) after a nearby neighbourhood. The airport handled 6,461,179 passengers in 2023.\n\nFor a full overview of new airports and scenery added to the marketplace this week have a look at the video below:\nhttps://youtu.be/H4pzAWuBFAA\n\n🔔 If you like this video please consider to subscribe to my channel: https://bit.ly/34eNWDP 🔔 \n\nAddon spotlight playlist: http://bit.ly/3qyiKXW\nWebsite: https://highintheflightsimsky.nl\n\n#FlightSimulator2020 #FlightSim #FS2020 #Shorts",
  "thumbnail": "https://i.ytimg.com/vi/T_EVKUyEgOA/sddefault.jpg",
  "thumbnailMedium": "https://i.ytimg.com/vi/T_EVKUyEgOA/mqdefault.jpg",
  "publishedAt": "2024-09-11T17:15:01.000Z",
  "duration": 56,
  "tags": [
    "MSFS 2020",
    "Bari Karol Wojtyła Airport",
    "Bari Airport addon",
    "Microsoft Flight Simulator",
    "flight sim review",
    "MSFS addon",
    "SimPixel Bari",
    "LIBD addon",
    "flight simulator 2020",
    "virtual flying",
    "high-resolution textures",
    "custom 3D models",
    "dynamic lighting",
    "realistic airport",
    "flight sim community",
    "aviation enthusiasts",
    "new MSFS addon",
    "must-have addon",
    "flight sim experience",
    "MSFS 2020 review",
    "airport scenery"
  ],
  "featured": false
}