{
  "videoId": "X34Y74Q0CvQ",
  "title": "Flight Simulator 2020 - POI's - Norway - Frogner Park",
  "description": "In this video we will fly over the Frogner Park. Frogner Park (Norwegian: Frognerparken) is a public park located in the West End borough of Frogner in Oslo, Norway. The park is historically part of Frogner Manor, and the manor house is located in the south of the park, and houses Oslo Museum. Both the park, the entire borough of Frogner as well as Frognerseteren derive their names from Frogner Manor.\n\nFrogner Park contains, in its present centre, the Vigeland installation (Norwegian: Vigelandsanlegget; originally called the Tørtberg installation), a permanent sculpture installation created by Gustav Vigeland between 1924 and 1943. It consists of sculptures as well as larger structures such as bridges and fountains. The installation is not a separate park, but the name of the sculptures within the larger Frogner Park. Informally the Vigeland installation is sometimes called \"Vigeland Park\" or \"Vigeland Sculpture Park\"; the director of Oslo Museum Lars Roede said \"Vigeland Park\" \"doesn't really exist\" and is \"the name of the tourists,\" as opposed to \"Oslo natives' more down-to-earth name, Frogner Park.\"\n\n🔔 If you like this video please consider to subscribe to my channel: https://bit.ly/34eNWDP 🔔 \n\nPOI playlist: https://bit.ly/3OX9zwv\nWebsite: https://highintheflightsimsky.nl\n\n#FlightSimulator2020 #FlightSim #FS2020 #shorts",
  "thumbnail": "https://i.ytimg.com/vi/X34Y74Q0CvQ/sddefault.jpg",
  "thumbnailMedium": "https://i.ytimg.com/vi/X34Y74Q0CvQ/mqdefault.jpg",
  "publishedAt": "2022-09-11T10:06:22.000Z",
  "duration": 33,
  "tags": [
    "Flight Simulator 2020",
    "flight plan",
    "microsoft flight simulator",
    "flight simulator",
    "microsoft flight simulator 2020",
    "msfs 2020",
    "flight sim 2020",
    "low altitude flight",
    "POI",
    "handcrafted",
    "handcrafted poi",
    "Frogner Park"
  ],
  "featured": false
}