{
  "videoId": "XHoGUQCG4GM",
  "title": "Explore the New Maastricht-Aachen Airport Addon for MSFS!",
  "description": "Maastricht-Aachen Airport, located in the heart of Europe, serves the Limburg region of the Netherlands and is strategically positioned near both Maastricht and Aachen, Germany. This addon features a meticulously crafted airport terminal, custom hangars, and accurate runway and apron layouts. You’ll also find custom static aircraft, ground vehicles, and highly detailed textures using Physically Based Rendering (PBR).\n\nOne of the standout features of this addon is the inclusion of the Eurocontrol Maastricht Upper Area Control Centre (MUAC), which manages air traffic control for the upper airspace over the Benelux countries and northern Germany. This adds an extra layer of realism to your flight simulation experience.\n\nWhether you’re flying cargo or passenger aircraft, this addon provides a rich and immersive environment. The developers have also included custom lighting models and taxiway signs to enhance your night flying experience.\n\nFor a full overview of items added to the marketplace this week have a look at the video below:\nhttps://youtu.be/zNT7PN40ia8\n\n🔔 If you like this video please consider to subscribe to my channel: https://bit.ly/34eNWDP 🔔 \n\nAddon spotlight playlist: http://bit.ly/3qyiKXW\nWebsite: https://highintheflightsimsky.nl\n\n#FlightSimulator2020 #FlightSim #FS2020 #Shorts",
  "thumbnail": "https://i.ytimg.com/vi/XHoGUQCG4GM/sddefault.jpg",
  "thumbnailMedium": "https://i.ytimg.com/vi/XHoGUQCG4GM/mqdefault.jpg",
  "publishedAt": "2024-09-05T17:15:01.000Z",
  "duration": 56,
  "tags": [
    "MSFS",
    "Microsoft Flight Simulator",
    "Maastricht-Aachen Airport",
    "EHBK",
    "ST Simulations",
    "Aerosoft",
    "flight simulation",
    "airport addon",
    "Eurocontrol",
    "MUAC",
    "cargo hub",
    "Limburg",
    "Netherlands",
    "aviation",
    "PBR textures",
    "GSX profile",
    "realistic scenery",
    "custom hangars",
    "custom lighting",
    "taxiway signs",
    "virtual flying",
    "msfs2020",
    "flight simulator",
    "flight simulator 2020"
  ],
  "featured": false
}